#include "delay.h"

/**********************************
** 函数使用说明：
** 在主函数初始化嘀嗒定时器	 Init_Delay();
** 延迟函数参考delay.h
**************************************/

/**********************************************************
** 函数名: Init_Delay
** 功能描述: 延迟函数初始化，设置嘀嗒定时器分频频率
** 输入参数: 无
** 输出参数: 无
***********************************************************/
void Init_Delay(void)
{
	SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8); //8分频   ==21MHZ
}

/**********************************************************
** 函数名: delay_us
** 功能描述: 微妙延迟函数
** 输入参数: nus：无符号整型变量 输入多少则延迟多少微妙
** 输出参数: 无
***********************************************************/
void delay_us(unsigned int nus)  //延迟us
{
	unsigned int temp = 0;
	SysTick->LOAD = 21*nus -1;
	SysTick->VAL  = 0x00;
	
	SysTick->CTRL |= (0x01<<0); 
	
	do{
		temp = SysTick->CTRL;
	}while((temp &(0x01))  && !(temp & (0x01<<16)));
	SysTick->CTRL &= ~(0x01<<0); 

}

/**********************************************************
** 函数名: delay_ms
** 功能描述: 毫秒延迟函数
** 输入参数: nms：无符号整型变量 输入多少则延迟多少毫秒
** 输出参数: 无
***********************************************************/
void delay_ms(unsigned int nms)	//延迟ms
{
	int i =0;
	for(i=0;i<nms;i++)
		delay_us(1000);
}

/**********************************************************
** 函数名: delay_s
** 功能描述: 秒延迟函数
** 输入参数: ns：无符号整型变量 输入多少则延迟多少秒
** 输出参数: 无
***********************************************************/
void delay_s(unsigned int ns)	//延迟s
{
	int i =0;
	for(i=0;i<ns;i++)
		delay_ms(1000);
}

